In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

# Connection Complete now to do questions

In [8]:
"""Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */ 
"""

"Q10: Produce a list of facilities with a total revenue less than 1000.\nThe output of facility name and total revenue, sorted by revenue. Remember\nthat there's a different cost for guests and members! */ \n"

In [11]:
df=pd.read_sql_query('SELECT * FROM (SELECT sub.facility, SUM( sub.cost ) AS total_revenue FROM (SELECT Facilities.name AS facility, CASE WHEN Bookings.memid =0 THEN Facilities.guestcost * Bookings.slots ELSE Facilities.membercost * Bookings.slots END AS cost FROM Bookings INNER JOIN Facilities ON Bookings.facid = Facilities.facid INNER JOIN Members ON Bookings.memid = Members.memid)sub GROUP BY sub.facility)sub2 WHERE sub2.total_revenue <1000',
                     engine)

In [12]:
df.head()

        facility  total_revenue
0     Pool Table            270
1  Snooker Table            240
2   Table Tennis            180

In [13]:
# Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [22]:
df2= pd.read_sql_query('SELECT m.surname, m.firstname, m.recommendedby AS recomender_id, r.surname AS recomender_surname, r.firstname AS recomender_firstname FROM Members AS m LEFT JOIN Members AS r ON m.recommendedby = r.memid WHERE m.recommendedby != 0 ORDER BY r.surname, r.firstname;', engine)

In [24]:
df2.head()

  surname firstname recomender_id recomender_surname recomender_firstname
0   GUEST     GUEST                             None                 None
1   Smith    Darren                             None                 None
2   Smith     Tracy                             None                 None
3  Rownam       Tim                             None                 None
4   Tracy    Burton                             None                 None

In [27]:

#/* Q12: Find the facilities with their usage by member, but not guests */

In [29]:
df3= pd.read_sql_query('SELECT b.facid, COUNT( b.memid ) AS mem_usage, f.name FROM ( SELECT facid, memid FROM Bookings WHERE memid !=0) AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY b.facid;', engine)

In [30]:
df3.head()

   facid  mem_usage             name
0      0        308   Tennis Court 1
1      1        276   Tennis Court 2
2      2        344  Badminton Court
3      3        385     Table Tennis
4      4        421   Massage Room 1

In [31]:

#/* Q13: Find the facilities usage by month, but not guests */

In [37]:
df4=pd.read_sql_query('SELECT f.name, (strftime('%Y-%m', starttime)) as month_count, count(*) as usage_count FROM Facilities as f INNER JOIN Bookings as b on b.facid = f.facid where b.memid != 0 group by f.name, month_count',engine)

SyntaxError: invalid syntax (1597883443.py, line 1)

In [ ]:
df4.head()